[
  {
    "timestamp": "2025-07-19T14:30:00.000000",
    "input": {
      "product_name": "Sony WH-1000XM4 Wireless Bluetooth Headphones",
      "product_features": "Premium wireless headphones with industry-leading noise cancellation technology. Features 30-hour battery life, quick charge (10 minutes for 5 hours), touch sensor controls, speak-to-chat technology, wearing detection, multipoint connection, LDAC codec support, comfortable over-ear design, foldable for travel, voice assistant compatible (Alexa, Google Assistant), black color, includes carrying case and cables."
    },
    "output": {
      "title": "Sony WH-1000XM4 Wireless Bluetooth Headphones with Industry-Leading Noise Cancellation, 30H Battery & Quick Charge",
      "key_features": "• Industry-leading Active Noise Cancellation technology\n• 30-hour battery life with quick charge (10min = 5hrs)\n• Premium sound quality with LDAC codec\n• Touch sensor controls and Speak-to-Chat\n• Wearing detection and multipoint connection\n• Voice assistant compatible (Alexa, Google Assistant)\n• Comfortable over-ear design with soft padding\n• Foldable design perfect for travel\n• Includes premium carrying case and cables",
      "description": "Experience unparalleled audio excellence with the Sony WH-1000XM4 Wireless Bluetooth Headphones. These premium headphones feature Sony's industry-leading noise cancellation technology, automatically adapting to your environment for optimal listening. With an impressive 30-hour battery life and quick charge capability, you'll never miss a beat. The advanced LDAC codec delivers exceptional sound quality, while touch sensor controls and innovative Speak-to-Chat technology provide seamless user experience. The comfortable over-ear design ensures all-day wearability, and the foldable construction makes them perfect for travel. Compatible with voice assistants and featuring multipoint connection, these headphones represent the pinnacle of wireless audio technology. Includes premium carrying case and necessary cables for complete convenience."
    },
    "model_used": "Ollama (Yerel - Ücretsiz)",
    "prompt_template": "walmart_product_content"
  },
  {
    "timestamp": "2025-07-19T14:35:00.000000",
    "input": {
      "product_name": "Apple iPhone 15 Pro Max 256GB",
      "product_features": "Latest iPhone with titanium design, A17 Pro chip, 6.7-inch Super Retina XDR display, advanced camera system with 5x telephoto lens, Action Button, USB-C connector, iOS 17, Face ID, wireless charging, water resistant IP68, available in multiple colors, 256GB storage capacity."
    },
    "output": {
      "title": "Apple iPhone 15 Pro Max 256GB - Titanium Design with A17 Pro Chip, Advanced Camera & USB-C",
      "key_features": "• A17 Pro chip for ultimate performance\n• 6.7-inch Super Retina XDR display\n• Advanced camera system with 5x telephoto\n• Durable titanium design construction\n• Action Button for quick shortcuts\n• USB-C connector for universal compatibility\n• iOS 17 with latest features\n• Face ID secure authentication\n• Wireless charging and MagSafe compatible\n• IP68 water resistance rating",
      "description": "Discover the future of smartphones with the Apple iPhone 15 Pro Max featuring 256GB storage. Built with aerospace-grade titanium, this flagship device combines durability with elegance. The revolutionary A17 Pro chip delivers unprecedented performance for gaming, photography, and productivity. The stunning 6.7-inch Super Retina XDR display provides vibrant colors and sharp details, while the advanced camera system with 5x telephoto lens captures professional-quality photos and videos. The new Action Button offers customizable quick access to your favorite features, and the USB-C connector ensures universal compatibility. With iOS 17, Face ID security, wireless charging capabilities, and IP68 water resistance, this iPhone represents the pinnacle of mobile technology. Perfect for professionals, creators, and anyone demanding the best in smartphone innovation."
    },
    "model_used": "Ollama (Yerel - Ücretsiz)",
    "prompt_template": "walmart_product_content"
  },
  {
    "timestamp": "2025-07-19T14:40:00.000000",
    "input": {
      "product_name": "Samsung 55-inch 4K QLED Smart TV",
      "product_features": "55-inch QLED display with 4K Ultra HD resolution, Quantum Dot technology, HDR10+ support, smart TV platform with streaming apps, voice control, gaming mode, multiple HDMI ports, wireless connectivity, sleek design, wall mountable, energy efficient."
    },
    "output": {
      "title": "Samsung 55\" 4K QLED Smart TV with Quantum Dot Technology, HDR10+ & Streaming Apps",
      "key_features": "• 55-inch 4K Ultra HD QLED display\n• Quantum Dot technology for vibrant colors\n• HDR10+ support for enhanced contrast\n• Smart TV platform with popular streaming apps\n• Voice control and smart remote\n• Gaming mode for optimized performance\n• Multiple HDMI and USB ports\n• WiFi connectivity and screen mirroring\n• Sleek design with wall mount compatibility\n• Energy efficient LED backlighting",
      "description": "Transform your entertainment experience with this Samsung 55-inch 4K QLED Smart TV. Featuring cutting-edge Quantum Dot technology, this television delivers over a billion colors for incredibly lifelike picture quality. The 4K Ultra HD resolution combined with HDR10+ support ensures every detail is crisp and vibrant, whether you're watching movies, sports, or playing games. The integrated smart TV platform provides instant access to popular streaming services, while voice control functionality makes navigation effortless. Gaming enthusiasts will appreciate the dedicated gaming mode that optimizes performance for smooth gameplay. With multiple connectivity options including HDMI and USB ports, plus wireless capabilities, this TV seamlessly integrates with all your devices. The sleek, modern design complements any room decor and includes wall mounting options for flexible placement. Energy-efficient LED backlighting ensures excellent performance while keeping power consumption low."
    },
    "model_used": "Ollama (Yerel - Ücretsiz)",
    "prompt_template": "walmart_product_content"
  },
  {
    "timestamp": "2025-07-19T13:15:26.430711",
    "input": {
      "product_name": "Ramadan Calendar Metal Islamic Gift Table Decor",
      "product_features": "Mark the holy month with elegance through the Islamic Gift Ramadan Calendar Metal Islamic Table Decor, a unique blend of functionality and spiritual beauty.\n\nThis piece, intricately designed with Islamic calligraphy, serves not only as a reminder of daily reflections but also as a stunning piece of Islamic art that enhances any Islamic home decor. Perfect for those observing the month's progress, it's an essential Muslim gift that beautifully complements Islamic wall art and Quran wall art, bringing the spirit of Ramadan into the heart of your home. Enhance your Ramadan decorations and celebrate Eid Mubarak with a touch of elegance that resonates with faith and tradition. This set is also an ideal Ramadan decor for your walls.\n\nSee other Islamic Table Decor by clicking here!\n\nExperience the Beauty of Islamic Wall Art\nWelcome to our Islamic Wall Art Store where tradition meets modernity in our exclusive collection of Islamic metal decor, Islamic wood decor and Islamic glass decor. Each piece is meticulously crafted to reflect the rich heritage and artistry of Islamic design. Whether you are looking for the timeless elegance of metalwork, classy wooden crafts, or the delicate beauty of glass art, our decor products promise to elevate any space with a touch of Islamic charm. Enjoy shopping at our store where faith and craftsmanship are beautifully intertwined."
    },
    "output": {
      "title": "",
      "key_features": "",
      "description": ""
    },
    "model_used": "Ollama (Yerel - Ücretsiz)",
    "prompt_template": "walmart_product_content"
  },
  {
    "timestamp": "2025-07-20T22:54:03.619683",
    "input": {
      "product_name": "Interior Mihrab Wooden Prayer Niche - Islamic Home Decor | 6-Pointed Star",
      "product_features": "A Timeless Symbol of Faith and Art\n\nThe Interior Mihrab Wooden Prayer Niche Islamic Wall Art Decor brings a sense of spiritual harmony to your Prayer Room. Crafted with geometric design, it embodies perfect symmetry and the sense of infinity, making it an essential centerpiece for Islamic interiors. Whether used for daily prayers or as a Ramadan gift, this elegant mihrab transforms your space into a divine sanctuary. With intricate details, including the 6-pointed star basic motif, it reflects traditional Islamic aesthetics while offering a modern touch.\n\nDiscover the exquisite mihrab decors designed by Islamic Wall Art Store.\n\n(Only the largest size mihrab can be mounted in the corner of the room, as shown in the sample image.)\n\nMihrab Meaning?\nA mihrab is a sacred architectural element in Islamic tradition, indicating the qibla, the direction of prayer towards the Kaaba in Mecca. More than just a marker, it enhances the spiritual connection of the worshipper, creating a divine atmosphere in Islamic Prayer Spaces. With its geometric design and perfect symmetry, the mihrab symbolizes order, reflection, and devotion.\n\nIslamic Wall Art Store – Elevate Your Prayer Room with Exquisite Decor\nCustomer satisfaction is our priority.\n\nAt Islamic Wall Art Store, we take pride in offering a refined collection of Prayer Room Decor to help create a sacred and peaceful ambiance in your home. Our Interior Mihrabs are crafted from premium wooden materials, incorporating stunning geometric designs that bring balance and harmony to any Islamic Home Decor setting.\n\nWhether you seek an elegant Ramadan Decor piece or a meaningful Islamic Gift, our mihrabs are designed to inspire. Our collection blends traditional craftsmanship with modern aesthetics, ensuring durability and beauty in every detail.\n\n"
    },
    "output": {
      "title": "Interior Mihrab Wooden Prayer Niche - Islamic Home Decor with Geometric Design",
      "key_features": "• Handcrafted from premium wooden materials for durability\n• Intricate geometric design symbolizing order and reflection\n• Perfect symmetry creating a sense of infinity in prayer spaces\n• Essential centerpiece for Islamic interiors, perfect for daily prayers or Ramadan gift-giving\n• Traditional Islamic aesthetics blended with modern touch\n• Includes 6-pointed star basic motif adding to its beauty",
      "description": "The Interior Mihrab Wooden Prayer Niche is an exquisite piece that brings spiritual harmony and balance to your prayer room. Crafted from premium wooden materials, it features a stunning geometric design that embodies perfect symmetry and the sense of infinity, making it an essential centerpiece for Islamic interiors. This beautiful mihrab not only serves as a marker indicating the qibla but also enhances the worshipper's connection with their faith by creating a divine atmosphere in prayer spaces. Its traditional aesthetic is blended perfectly with modern touches, ensuring its beauty stands out while remaining true to Islamic traditions. Whether used daily or gifted during Ramadan, this mihrab decor piece adds elegance and spiritual depth to any home, making it an ideal choice for those seeking to elevate their worship experience. With a unique blend of form and function, the Interior Mihrab Wooden Prayer Niche is more than just a decorative item; it's a symbol of devotion that inspires reflection and order in every aspect of life. Its handcrafted nature ensures durability, guaranteeing years of beautiful service as part of your home decor collection. By incorporating this mihrab into your prayer space or gifting one to loved ones during Ramadan, you're not only enhancing their spiritual connection but also adding a touch of timeless elegance that resonates with faith and tradition. Experience the beauty of Islamic artistry in every detail of this exquisite piece, designed to inspire devotion and peace within any home."
    },
    "model_used": "Ollama (Yerel - Ücretsiz)",
    "prompt_template": "walmart_product_content"
  }
]